Repository: ibrahimsiam25/grad_project_edu
Catalog: lib/l10n/intl_*.arb
Languages: ar

# app_title
source: E-Learning
ar: التعليم الالكتروني

# welcome_message
source: Welcome back! Please log in to access your dashboard and stay productive.
ar: أهلاً وسهلاً بعودتك! من فضلك سجّل دخولك للوصول إلى لوحة التحكم الخاصة بك وابقَ منتجاً.

source: Email
ar: الإيميل

source: Password
ar: كلمة المرور

source: Log In
ar: تسجيل دخول

# success_message
source: Everything will return to its place!
ar: كله هيرجع لمكانه!

# forgot_password_message
source: 🔑 It's okay! Just enter your email so we can recover your account and password!
ar: 🔑 مهمل بس ولا يهمك! اكتب إيميلك علشان نرجعلك حسابك وكلمة السر تاني!

source: Confirm
ar: تأكيد

# security_confirmation
source: Confirmation for security!
ar: تاكيد للأمان!

# verify_account
source: Verify your account!
ar: أكد حسابك!

# enter_code
source: Enter the 6-digit code that was sent to you.
ar: أدخل الكود المكون من 6 أرقام اللي اتبعت ليك.

source: Resend?
ar: إعادة الإرسال؟

# field_is_required
source: This field is required
ar: هذا الحقل مطلوب

# forgot_password
source: Forgot your password?
ar: هل نسيت كلمة السر؟

source: E-Learning
ar: التعليم الإلكتروني

source: Weekly Schedule
ar: الجدول الإسبوعي

source: Time Schedule
ar: الجدول الزمني

source: Internal Map
ar: الخريطة الداخلية

source: Academic Progress
ar: التقدم الأكاديمي

source: Final Results
ar: النتائج النهائية

source: Profile
ar: الملف الشخصي

source: Logout
ar: تسجيل الخروج

# selectCources
source: 📚 Please select the courses you want to follow for updates and announcements!
ar: 📚 يرجى اختيار المواد التي تود الاطلاع على منشوراتها وآخر مستجداتها!

source: Announcements
ar: الأخبار المعلنه

source: Courses
ar: المواد

source: Chat
ar: الدردشة

# select_subjects
source: 📚 Please select the subjects you want to check for posts and updates!
ar: 📚 يرجى اختيار المواد التي تود الاطلاع على منشوراتها وآخر مستجداتها!

source: Status:
ar: الحالة:

source: Classes:
ar: الفصول:

source: Community
ar: المنتدي

# youCanJoinToChat
source: 👥 You can join your academic year's private group to connect with your classmates!
ar: 👥 يمكنك الانضمام إلى المجموعة الخاصة بعامك الدراسي فقط للتواصل مع زملائك!

# goLearnCommunicate
source: Connect. Learn. Go!
ar: تواصل. تعلّم. انطلق!

# cooperateShareThoughts
source: Collaborate, share your ideas, and learn from your peers easily 📚
ar: تعاون، شارك أفكارك، وتعلّم من زملائك بسهولة 📚

# startWriting
source: Start writing now..
ar: إبدأ في الكتابة الأن..

# discoverYourWay
source: 🔍 Easily discover your way around the university.
ar: 🔍 اكتشف طريقك بسهولة داخل الجامعة.

# didntSreachYet
source: 🤔 You haven't searched for anything yet!
ar: 🤔 لم تبحث عن شيء بعد!

# writeYourPlace
source: Write the name of the place you want to reach.
ar: اكتب اسم المكان الذي تريد الوصول إليه.

# searchForBuilding
source: Search for a building, lecture hall, room, etc..!
ar: ابحث عن مبني، مدرج، قاعة، الخ..!

# mostSreached
source: Most searched places!
ar: الاماكن الأكثر بحثاً!

source: students online now
ar: طالب نشط الآن

source: Completed
ar: المكتملة

# semester_2
source: Second Semester
ar: الفصل الدراسي الثاني

# semester_1
source: First Semester
ar: الفصل الدراسي الأول

source: In Progress
ar: قيد التنفيذ

source: Pending
ar: معلق

source: Not Started
ar: لم يبدأ

source: Study
ar: دراسة

# forum_welcome_message
source: 💬 Welcome to the Q&A forum! Ask your questions, share your knowledge by answering others' questions, and benefit from your peers' experiences here!
ar: 💬 مرحباً بك في منتدى الأسئلة والإجابات!اطرح أسئلتك، وشارك معرفتك بالإجابة على أسئلة الآخرين، واستفد من خبرات زملائك هنا!

source: Add your question!
ar: أضف سؤالك !

source: Filter
ar: تصفية

source: View answers
ar: عرض الإجابات

# interested
source: like
ar: مهتم

source: Question statistics
ar: إحصائيات هذا السؤال

source: Answer
ar: إجابة

source: View
ar: مشاهدة

source: Start
ar: ابدأ

source: 🗺️ Where am I now?
ar: 🗺️ أين أنا الآن؟

source: Where are you going boss?
ar: إلي اين انت ذاهب يمدير!

# testYourKnowledge
source: 📋 Test your knowledge and prepare for the exam by answering the customized questions!
ar: 📋 اختبر معلوماتك، واستعد للامتحان من خلال الإجابة على الأسئلة المخصصة!

source: Quiz
ar: اختبار

# quizDesc
source: Quiz Description
ar: وصف الاختبار

source: Start Now!
ar: ابدأ الآن!

source: Quiz Details
ar: تفاصيل الاختبار

# quizState
source: Quiz Status
ar: حالة الاختبار

# classification
source: Category
ar: التصنيف

source: Quiz Duration
ar: مدة الاختبار

# didntStartYet
source: Not Started Yet
ar: لم يبدأ بعد

source: Classwork
ar: أعمال السنة

source: Minute
ar: دقيقة

source: Once
ar: مرة واحدة

# numOfTimesAllowed
source: Allowed Attempts
ar: المرات المسموح بها

# quizAdvices
source: Quiz Tips
ar: نصائح للاختبار

# prepareWell
source: 📚 Prepare in Advance
ar: 📚 استعد مسبقًا

# reviewTopics
source: Set aside time to review and understand key topics.
ar: خصص وقتًا للمراجعة وفهم المواضيع الرئيسية.

# manageTime
source: ⏰ Manage Your Time
ar: ⏰ نظم وقتك جيدًا

# timeManagement
source: Divide your time wisely between questions, and don’t spend too long on one.
ar: قسّم وقت الاختبار بين الأسئلة، ولا تقضِ وقتًا طويلًا على سؤال واحد.

# readCarefully
source: 🔍 Read Questions Carefully
ar: 🔍 اقرأ الأسئلة بتركيز

# understandBeforeAnswering
source: Make sure you fully understand the question before answering.
ar: تأكد من فهم السؤال جيدًا قبل البدء بالإجابة.

# stayCalm
source: 😌 Stay Calm and Focused
ar: 😌 استرخِ وابقَ هادئًا

# stayConfident
source: Take deep breaths and trust your abilities!
ar: تنفّس بعمق وثق بقدراتك!

source: Good Luck! 🍀
ar: بالتوفيق! 🍀

source: Time Remaining
ar: الوقت المتبقي

source: Clear Answer Selection
ar: حذف تحديد الإجابة

source: Next
ar: التالي

source: Previous
ar: السابق

# submitAndFinish
source: Submit & Finish
ar: الإنهاء والتقديم

source: Quiz Navigation
ar: التنقل في الاختبار

source: Done
ar: تم

source: All Days
ar: كل الأيام

source: Saturday
ar: السبت

source: Sunday
ar: الأحد

source: Monday
ar: الإثنين

source: Tuesday
ar: الثلاثاء

source: Wednesday
ar: الأربعاء

source: Thursday
ar: الخميس

source: Days
ar: الأيام

source: Subject Name
ar: اسم المادة

source: Time
ar: الوقت

source: Type
ar: النوع

source: Teacher
ar: المعلم

source: Place
ar: المكان

# condition
source: status
ar: الحالة

source: Weekly Schedule
ar: الجدول الاسبوعي

# schedule_welcome_message
source: 📅 Welcome to the Weekly Schedule page! Select the days you want to view to easily track your lecture and practical session timings.
ar: 📅 مرحباً بك في صفحة الجدول الأسبوعي! حدد الأيام التي ترغب في عرض جدولها لتتابع مواعيد محاضراتك وجلساتك العملية بسهولة.

# profile_welcome_message
source: 👤Welcome to the profile page! 📝 Here you can review and update your personal information.
ar: 👤 مرحباً بك في صفحة البروفايل! 📝 هنا يمكنك مراجعة وتحديث معلوماتك الشخصية.

source: Profile Picture
ar: الصورة الشخصية

source: Group
ar: مجموعة

source: Section
ar: سكشن

# main_info
source: Main information
ar: المعلومات الأساسية

source: Name
ar: الإسم

source: College
ar: الكلية

source: Level
ar: الفرقة

source: Group
ar: مجموعة

source: Section
ar: سكشن

source: Overall Grade
ar: تقدير تراكمي

source: Material
ar: ماتريال

# material_description
source: 🎓📚 Everything you need for your course in one place: lectures, sections, assignments, quizzes, videos, midterms, and final exams!
ar: 🎓📚 كل اللي محتاجه لمادتك في مكان واحد: محاضرات، سكاشن، اسايمنتات، كويزات، فيديوهات، ميدتيرم، وامتحانات نهائية!

source: complete
ar: إكتمل

source: open
ar: فتح

source: download
ar: تحميل

source: Lectures
ar: المحاضرات

source: Sections
ar: سكشن

source: Assignment
ar: الاسايمنت

source: all
ar: الكل

source: Dashboard
ar: لوحة التحكم

source: News
ar: الأخبار

source: Quizzes
ar: الكويزات

source: Assignments
ar: التكاليف

source: Add News!
ar: أضف خبر !

# create_and_manage_news
source: 📰 Create and manage important news and announcements for your courses easily, and keep your students updated!
ar: 📰 أنشئ وأدر الأخبار والإعلانات الهامة لموادك الدراسية بسهولة، وأبقى طلابك على اطلاع دائم!

# course_management_center
source: 👨‍🏫 Easily manage your courses, from students to lectures and quizzes!
ar: 👨‍🏫 مركز إدارة المواد الدراسية الخاصة بك بكل سهولة، من الطلاب إلى المحاضرات والكويزات!

# add_new
source: Add New Annoucement
ar: إضافة خبر جديد

# add_new_news
source: 🆕 Add a new news item to keep your students updated with all the latest news and updates
ar: 🆕 أضف خبرًا جديدًا لإبقاء طلابك على اطلاع دائم بكل التحديثات والمستجدات

# news_title
source: Annoucement Title
ar: عنوان الخبر

# news_title_description
source: Add a clear and direct title that summarizes the Annoucement accurately!
ar: قم بإضافة عنوان واضح ومباشر يُلخص الخبر بدقة!

# news_content
source: Annoucement Content
ar: محتوي الخبر

# news_content_description
source: Add the Annoucement details to clarify the information for students!
ar: أضف تفاصيل الخبر لتوضيح المعلومات للطلاب!

source: Study Level
ar: الفرقة الدراسية

source: Subject
ar: المادة الدراسية

# schedule_publish_time
source: Set Publish Time
ar: ضبط موعد للنشر

# publish_time_description
source: Set a time to publish the Annoucement as a public announcement!
ar: تحديد موعد لنشر الخبر كخبر علني !

source: Publish!
ar: نشر !

source: View Registered Students
ar: عرض الطلاب المسجلين

source: View Curriculum
ar: عرض المنهج الدراسي

# full_control_over_courses
source: 📚 Full control over your courses, from adding lectures to tracking student progress and managing quizzes and assignments!
ar: 📚 تحكم كامل بموادك الدراسية، من إضافة المحاضرات إلى متابعة تقدم الطلاب وإدارة الكويزات والأسايمنتات!

source: QR attendance
ar: تسجيل حضور “QR”

source: Add courses
ar: إضافة مواد دراسية

source: Update lecture status
ar: تحديث حالة المحاضرة

# academic_progress_welcome_message
source: 🎓Find out your academic level with ease. Details of your grades and ranking are at your fingertips!
ar: !تعرّف على مستواك الأكاديمي بكل سهولة تفاصيل درجاتك وترتيبك في متناول يدك🎓

source: Percentage
ar: النسبة المئوية

# first_semester
source: 1st Semester
ar: ترم أول

# second_semester
source: 2nd Semester
ar: ترم ثاني

# number_of_subjects
source: Subjects count
ar: عدد المواد

source: Total
ar: المجموع

source: Attendance
ar: الحضور

source: Midterm
ar: الميدتيرم

source: Classwork
ar: أعمال الفصل

source: Final exam
ar: الإختبار النهائي

# students_count
source: No. of students
ar: عدد الطلاب:

source: Cancel
ar: إلغاء

# update_lecture_status_title
source: 📅 Update lecture status!
ar: 📅تحديث حالة المحاضرة!

# update_lecture_status_description
source: Select the current lecture status based on its actual situation..
ar: حدد الحالة الحالية للمحاضرة بناءً على وضعها الفعلي..

# on_time
source: On time (automatic).
ar: في الوقت المحدد (تلقائي).

source: Postponed.
ar: مؤجل.

source: Students Management
ar: إدارة الطلاب

source: Forum Management
ar: إدارة المنتدي

source: Final Grades
ar: الدرجات النهائية

source: Registered Students
ar: الطلاب المسجلين

# registered_students_count
source: No. of registered students:
ar: عدد الطلاب المسجلين بالمادة:

# registered_students_description
source: 👥 View a list of all students registered in the course with details like name and academic number.
ar: 👥 استعرض قائمة جميع الطلاب المسجلين في المادة مع تفاصيل مثل الاسم، الرقم الأكاديمي،

# search_placeholder
source: Enter the student’s name
ar: أدخل اسم الطالب

# materials_center
source: 👨‍🏫 Easily manage your course materials—from students to lectures and quizzes!
ar: 👨‍🏫 مركز إدارة المواد الدراسية الخاصة بك بكل سهولة، من الطلاب إلى المحاضرات والكويزات!

# time_schedule_welcome_message
source: Welcome! Here you can view the upcoming quiz dates and submit the fees for each subject.⏰
ar: مرحباً بك!هنا يمكنك الاطلاع على مواعيد الكويزات القادمة وتسليم التكاليف لكل مادة.⏰

# search_for_task
source: Search by activity type or name
ar: البحث حسب نوع النشاط او الاسم

# next_seven_days
source: Next 7 Days
ar: 7 أيام القادمة

source: Add to send
ar: إضافة للإرسال

source: sent
ar: تم الإرسال

source: Add Study Content
ar: إضافة محتوى دراسي

# addStudyContentSubtitle
source: 📚 Easily add new study materials and manage their details!
ar: 📚 قم بإضافة مواد دراسية جديدة وإدارة تفاصيلها بكل سهولة!

# lectureTitleHint
source: Enter a clear title that accurately reflects the lecture topic!
ar: أدخل عنوانًا واضحًا يعكس موضوع المحاضرة بدقة!

# lectureDescriptionHint
source: A brief summary of the lecture content and its educational objectives!
ar: مختصرًا حول محتوى المحاضرة وأهدافها التعليمية!

source: Lecture Title
ar: عنوان المحاضرة

source: Lecture Description
ar: وصف المحاضرة

source: Add Link
ar: إضافة رابط

source: Upload Files
ar: رفع الملفات

# pleaseEnterRequiredFields
source: Please enter the required fields
ar: من فضلك ادخل الحقول المطلوبة

source: Click here to add more files
ar: اضعط هنا لإضافة المزيد من الملفات

# noFilesUploaded
source: No files uploaded yet
ar: لم يتم رفع أي ملفات بعد

# addLinkDescrebtion
source: Add a link to the study material.
ar: قم بإضافة رابط مباشر للمحتوى او المصدر!

# final_results_welcome_message
source: 📊 Welcome to the final results page! Here you can easily and clearly review your academic performance and grades in various courses. We wish you all the best and success!
ar: 📊 مرحباً بك في صفحة النتائج النهائية! هنا يمكنك الاطلاع على أدائك الأكاديمي ومعرفة درجاتك في المقررات المختلفة بكل سهولة ووضوح. نتمنى لك كل التوفيق والنجاح!

source: Course Name
ar: اسم المادة

source: Course Code
ar: كود المقرر

source: Grade
ar: التقدير

source: Course Status
ar: موقف المادة

source: OK
ar: حسناً

# createQuiz
source: Create a new quiz
ar: إنشاء كويز جديد

# quizHelperText
source: ❓Create, edit, and track quiz scores easily to ensure effective evaluation!
ar: ❓أنشئ، عدّل، وتابع درجات الكويزات بسهولة لضمان تقييم فعال!

source: Quiz Title
ar: عنوان الكويز

# quizTitleHelper
source: Enter a clear title that reflects the quiz topic.
ar: دخل عنوانًا واضحًا يعبر عن موضوع الكويز.

source: Quiz Description
ar: وصف الكويز

# quizDescriptionHelper
source: Provide a brief description that outlines the quiz content and objectives.
ar: قدم وصفًا موجزًا يوضح محتوى الكويز وأهدافه.

source: Set Time
ar: تحديد الوقت

# questionsCount
source: Number of Questions
ar: عدد الأسئلة

source: Question Grade
ar: درجة السؤال

source: Final Grade
ar: الدرجة النهائية

# single_grade
source: Grade
ar: درجة

source: Schedule Quiz
ar: جدولة الكويز

# scheduleQuizHelper
source: Set a time to publish the quiz as public news!
ar: تحديد موعد لنشر الخبر كخبر علني !

source: Starts at
ar: يبدأ

source: Ends at
ar: ينتهي

source: Questions
ar: الأسئلة

# questionTypeHelper
source: Choose the type of questions you want to include in the quiz
ar: اختر نوع الأسئلة التي تريد تضمينها في الكويز

source: Multiple Choice
ar: إختيارات متعددة

# text
source: Texts
ar: نصوص

source: Images
ar: صور

# showResultsAfterSubmit
source: Show results and allow viewing answers after completing the quiz
ar: عرض النتائج وإتاحة الإجابة لهم بعد الإنتهاء من الإختبار

source: Select Week
ar: اختر الأسبوع

source: Week
ar: الأسبوع

# questionsWithNoThe
source: Questions
ar: أسئلة

source: Select Date
ar: اختر تاريخ

source: Select Time
ar: اختر وقت

source: Enter your question
ar: ادخل سؤالك

# maximumNumberOfQuestions
source: Maximum number of questions reached
ar: تجاوزت الحد الاقصي لعدد الاسئلة الذي اختارته

# incompleteQuestionError
source: All questions must have a question, at least one answer, and a selected correct answer.
ar: يجب أن تحتوي جميع الأسئلة على سؤال، وإجابة واحدة على الأقل، وإجابة صحيحة مختارة.

# dateAndTimeError
source: You have to specify date and time for the quiz.
ar: يجب تحديد التاريخ والوقت للاختبار.

# atLeastTwoAnswers
source: Please provide at least two answers for each question
ar: يرجى تقديم إجابتين على الأقل لكل سؤال

source: Edit
ar: تعديل

source: Delete
ar: حذف

source: Edit Announcement
ar: تعديل خبر

# edit_news
source: ✏️ Edit your announcement to keep your students informed with the latest details and updates
ar: ✏️ عدّل إعلانك لضمان بقاء طلابك على اطلاع بأحدث التفاصيل والتحديثات

source: Other
ar: اخري

source: Lecture
ar: محاضرة

# pleaseUploadFiles
source: Please upload the files first
ar: من فضلك ارفع الملفات اولاً

source: Search
ar: بحث

# statuss
source: status
ar: الحاله

# assignments_home_message
source: 📝 Organize assignments, review solutions, and update grades with ease!
ar: 📝 نظم الواجبات، راجع الحلول، وقم بتحديث الدرجات بكل سهولة!

source: Create Assignment
ar: إنشاء إسايماينت

source: Scheduled Assignments
ar: اسايمينتات مجدولة

source: Previous Assignments
ar: اسايمينتات سابقة

source: Create New Assignment
ar: إنشاء أسايمنت جديد

# create_assignment_welcome_message
source: 📑 Create a new assignment by specifying a title, description, due date, and attaching any supporting files.
ar: 📑 قم بإنشاء أسايمنت جديد من خلال تحديد العنوان والوصف وموعد التسليم وإرفاق أي ملفات توضيحية.

source: Assignment Title
ar: عنوان الأسايمنت

# assignment_title_hint_text
source: Enter a title that clearly describes the content of the assignment.
ar: أدخل عنوانًا يعبر عن محتوى الأسايمنت بشكل واضح.

source: Assignment Description
ar: وصف الأسايمنت

# assignment_description_hint_text
source: Provide a detailed explanation of what is required in the assignment, along with any additional instructions.
ar: قدم شرحًا تفصيليًا حول المطلوب في الأسايمنت، مع أي تعليمات إضافية.

source: Assignment Degree
ar: درجة الأسايمنت

source: Final Date
ar: الموعد النهائي

# choose_assignment_deadline
source: ⏰ Specify the assignment submission deadline and closing time.
ar: ⏰ حدد الموعد النهائي لتسليم الأسايمنت وتوقيت إغلاقه.

source: Starts In
ar: يبدأ في

source: Ends In
ar: ينتهي في

source: Add File
ar: إضافة ملف

source: Scheduled Quizzes
ar: كويزات مجدولة

source: Previous Quizzes
ar: كويزات سابقة

# scheduled_quizzes_description
source: 📅 View a list of upcoming quizzes with start/end times and settings.
ar: 📅 عرض قائمة بالكويزات المجدولة مع مواعيد البدء والانتهاء والإعدادات الخاصة بها.

# previous_quizzes_description
source: 📜 Browse past quizzes, review results and answers, and assess performance.
ar: 📜 استعرض الكويزات التي انتهت، مع إمكانية مراجعة النتائج والإجابات وتقييم الأداء.

source: Results
ar: النتائج

# results_description
source: 📊 View students’ quiz results, including grades!
ar: 📊 استعرض نتائج الطلاب في الكويزات، بما في ذلك الدرجات!

# average_score
source: Average student score in this quiz
ar: متوسط درجات الطلاب في هذا الاختبار

source: Score
ar: درجة

# finalDegree
source: Final
ar: نهائية

# theSearch
source: Search..
ar: البحث..

# scheduled_assignments_description
source: 📅 View a list of upcoming assignments with delivery dates, status, and the ability to modify or cancel.
ar: 📅 عرض قائمة الأسايمنتات القادمة مع مواعيد التسليم والحالة وإمكانية التعديل أو الإلغاء.

# previous_assignments_description
source: 📜 View completed assignments, with the ability to review solutions, grades, and comments.
ar: 📜 استعرض الأسايمنتات التي انتهت، مع إمكانية مراجعة الحلول، الدرجات، والتعليقات.

source: Assignment Details
ar: تفاصيل الأسايمنت

source: From
ar: من

source: To
ar: إلى

source: Scheduled
ar: مجدول

source: Edit Quiz
ar: تعديل كويز

source: Assignment uploaded successfully
ar: تم رفع الأسايمنت بنجاح

source: On Map
ar: على الخريطة

source: Show Directions
ar: عرض الاتجاهات

# assignment_correction_welcome_message
source: 📑⚡ Review submitted assignments, evaluate answers, and view grades with the ability to send comments to each student.
ar: 📑⚡ راجع الأسايمنتات المرسلة، قم بتقييم الإجابات، واعرض الدرجات مع إمكانية إرسال التعليقات لكل طالب.

# select_all_to_give_degree
source: Select all and give a score
ar: تحديد الكل وإعطاء درجة

source: Enter student name or code
ar: ادخل اسم الطالب أو الكود

source: Show
ar: عرض

# evaluation
source: Evaluate
ar: تقييم

# number_of_students_who_handed_assignment
source: Number of students who submitted the assignment
ar: عدد الطلاب الذين سلموا الأسايمنت

source: Average student scores in this assignment
ar: متوسط درجات الطلاب في هذا الأسايمنت

source: Student Grade
ar: درجة الطالب

source: Add Grade
ar: إضافة تقييم

# the_degree
source: Degree
ar: الدرجة

source: Questions Count
ar: عدد الأسئلة

source: Show Image
ar: عرض الصوره

source: Unknown
ar: غير معروف

source: Semester
ar: ترم

# quizNotStarted
source: Quiz hasn't started yet
ar: لم يبدأ بعد

source: Started
ar: بدأ

# university_code
source: ID
ar: الكود الجامعي

source: National ID
ar: الرقم القومي

source: Nationality
ar: الجنسية

source: department
ar: القسم

source: Edit Profile
ar: تعديل الملف الشخصي

source: Enter new password
ar: ادخل كلمة سر جديدة

source: Route Details
ar: تفاصيل المسار

source: Duration
ar: المدة

source: Distance
ar: المسافة

# hour
source: h
ar: ساعة

# meter
source: m
ar: متر

source: min
ar: دقيقة

source: km
ar: كيلومتر

source: Instructions
ar: التعليمات

source: Street
ar: شارع

source: Halls
ar: القاعات

source: No Buildings Found
ar: لم يتم العثور على مباني

source: Retry
ar: اعادة المحاولة

source: Parking Slots
ar: مواقف السيارات

# parkingSlotsDescription
source: 🚗 Browse available parking slots and easily check for empty spaces
ar: 🚗 استعرض المواقف المتاحة وتحقق من الأماكن الخالية بسهولة

# studentsAnswersReview
source: Student Answers Review
ar: مراجعة الإجابات

source: Student Degree
ar: درجة الطالب

source: No Students Found
ar: لم يتم العثور على طلاب

source: Deadline
ar: موعد التسليم

source: preview
ar: عرض

source: Assignment Preview
ar: عرض الأسايمنت

source: Edit Assignment
ar: تعديل الأسايمنت

# edit_assignment_welcome_message
source: ✏️ Edit the assignment details to keep your students informed with the latest updates and requirements.
ar: ✏️ عدّل تفاصيل الأسايمنت لتحديث المعلومات أو المواعيد أو الملفات المرفقة.

source: No Halls Found
ar: لم يتم العثور على قاعات

source: Code
ar: الكود

source: Buildings
ar: المباني

# manage_materials_and_display
source: Manage and display materials
ar: عرض المواد وإدارتها

# no_answers_available
source: No answers available for this question
ar: لا توجد إجابات متاحة لهذا السؤال
